In [2]:
# %load ("bank_1min.RData")
#bank_1min.RData

In [3]:
pip install pyreadr

Collecting pyreadr
  Downloading https://files.pythonhosted.org/packages/e1/c0/649afdcad64f3a10057036b2041cfdae1a090555d4a033c00b7b46dba3af/pyreadr-0.2.3-cp37-none-win_amd64.whl (873kB)
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (from pyreadr) (0.24.2)
Requirement already satisfied: numpy>=1.12.0 in c:\programdata\anaconda3\lib\site-packages (from pandas->pyreadr) (1.16.4)
Requirement already satisfied: pytz>=2011k in c:\programdata\anaconda3\lib\site-packages (from pandas->pyreadr) (2019.1)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\programdata\anaconda3\lib\site-packages (from pandas->pyreadr) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas->pyreadr) (1.12.0)
Installing collected packages: pyreadr
Successfully installed pyreadr-0.2.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pyreadr

result = pyreadr.read_r('bank_1min.RData')

df = result['bank_1min']

In [2]:

print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [3]:
import pandas as pd
df.to_csv('bank1min')

In [4]:
data = pd.read_csv('bank1min')

In [5]:
data

,Unnamed: 0,index,date,time,open,high,low,close,id
0,0,BANKNIFTY,20121203,09:16,12125.70,12161.70,12125.70,12160.95,2012DECBNF.txt
1,1,BANKNIFTY,20121203,09:17,12161.75,12164.80,12130.40,12130.40,2012DECBNF.txt
2,2,BANKNIFTY,20121203,09:18,12126.85,12156.10,12126.85,12156.10,2012DECBNF.txt
3,3,BANKNIFTY,20121203,09:19,12157.25,12164.75,12151.60,12164.20,2012DECBNF.txt
4,4,BANKNIFTY,20121203,09:20,12162.80,12162.80,12148.20,12151.15,2012DECBNF.txt
...,...,...,...,...,...,...,...,...,...
367570,367570,BANKNIFTY,20160930,15:26,19321.00,19322.80,19314.25,19318.35,2016SEPBNF.txt
367571,367571,BANKNIFTY,20160930,15:27,19318.80,19322.20,19312.30,19317.40,2016SEPBNF.txt
367572,367572,BANKNIFTY,20160930,15:28,19317.55,19323.40,19314.45,19315.95,2016SEPBNF.txt
367573,367573,BANKNIFTY,20160930,15:29,19315.80,19324.20,19312.00,19314.10,2016SEPBNF.txt
367574,367574,BANKNIFTY,20160930,15:30,19313.60,19330.85,19311.20,19323.20,2016SEPBNF.txt

In [6]:
time9 = df[df['time']=='09:16']
time10 = df[df['time']=='10:00']
time11 = df[df['time']=='11:00']
time12 = df[df['time']=='12:00']
time13= df[df['time']=='13:00']
time14 = df[df['time']=='14:00']
time15 = df[df['time']=='15:00']
time1530 = df[df['time']=='15:30']

In [7]:
time9=time9.append(time10)
time9=time9.append(time11)
time9=time9.append(time12)
time9=time9.append(time13)
time9=time9.append(time14)
time9=time9.append(time15)
time9=time9.append(time1530)

In [8]:
bank1hour = time9.sort_index()

In [9]:
bank1hour.to_csv('bank1hour.csv')

In [10]:
bank1hour.head()

,index,date,time,open,high,low,close,id
0,BANKNIFTY,20121203,09:16,12125.70,12161.70,12125.70,12160.95,2012DECBNF.txt
44,BANKNIFTY,20121203,10:00,12117.15,12121.75,12109.10,12109.10,2012DECBNF.txt
104,BANKNIFTY,20121203,11:00,12091.65,12093.55,12090.05,12091.35,2012DECBNF.txt
164,BANKNIFTY,20121203,12:00,12095.30,12099.20,12095.30,12098.90,2012DECBNF.txt
224,BANKNIFTY,20121203,13:00,12100.40,12104.90,12100.40,12102.80,2012DECBNF.txt

In [11]:
bank1hour.tail()

,index,date,time,open,high,low,close,id
367364,BANKNIFTY,20160930,12:00,19196.85,19199.40,19190.5,19191.95,2016SEPBNF.txt
367424,BANKNIFTY,20160930,13:00,19199.90,19212.90,19196.1,19201.70,2016SEPBNF.txt
367484,BANKNIFTY,20160930,14:00,19258.35,19259.10,19246.3,19247.15,2016SEPBNF.txt
367544,BANKNIFTY,20160930,15:00,19248.80,19267.20,19244.1,19259.40,2016SEPBNF.txt
367574,BANKNIFTY,20160930,15:30,19313.60,19330.85,19311.2,19323.20,2016SEPBNF.txt

In [12]:
result = pyreadr.read_r('data/companyList.RData')

#clist = result['company_list']
type(result)

collections.OrderedDict

In [13]:
cmp_list = result['companyList']
cmp_list.head(20)

                                  company          id    data
0                             3i Infotech  3IINFOTECH  nse_AA
1              8K Miles Software Services     8KMILES  nse_AA
2                   Aban Offshore Limited        ABAN  nse_AA
3                   Aban Offshore Limited        ABAN  nse_AA
4                           A B B Limited         ABB  nse_AA
5                    Abbott India Limited  ABBOTINDIA  nse_AA
6               Aditya Birla Nuvo Limited  ABIRLANUVO  nse_AA
7                             ACC Limited         ACC  nse_AA
8               Adani Enterprises Limited    ADANIENT  nse_AA
9   Adani Ports and Special Economic Zone  ADANIPORTS  nse_AA
10                    Adani Power Limited  ADANIPOWER  nse_AA
11            Ahluwalia Contracts Limited       India  nse_II
12            Ahmednagar Forgings Limited  AHMEDFORGE  nse_AA
13              A I A Engineering Limited      AIAENG  nse_AA
14                           ALSTOM India         AIL  nse_AA
15                  Ajanta Pharma Limited  AJANTPHARM  nse_AA
16                       Akzo Nobel India   AKZOINDIA  nse_AA
17                         Allahabad Bank        ALBK  nse_AA
18                        Alembic Limited  ALEMBICLTD  nse_AA
19      Allcargo Global Logistics Limited    ALLCARGO  nse_AA

In [15]:
file = pyreadr.read_r('data/nse_AA.RData')
nseAA = file['nse_AA']
nseAA.head()

           id      date      time  open  high   low  close volume
0  3IINFOTECH  20150703  09:16:00  4.55  4.55  4.55   4.55    835
1  3IINFOTECH  20150703  09:17:00  4.55  4.55  4.55   4.55    390
2  3IINFOTECH  20150703  09:18:00  4.55  4.55  4.55   4.55   1000
3  3IINFOTECH  20150703  09:19:00  4.55  4.55  4.55   4.55   1150
4  3IINFOTECH  20150703  09:20:00  4.55  4.55  4.55   4.55   1100

In [16]:
ABB = nseAA.loc[nseAA['id']=='ABB']
ABB.head()

         id      date      time    open     high      low    close volume
224772  ABB  20150703  09:16:00  1365.3  1370.95  1365.30  1369.55     82
224773  ABB  20150703  09:17:00  1371.0  1378.00  1370.80  1378.00    827
224774  ABB  20150703  09:18:00  1378.0  1378.00  1375.00  1376.00    425
224775  ABB  20150703  09:19:00  1377.9  1378.00  1375.00  1375.05    398
224776  ABB  20150703  09:20:00  1375.0  1377.70  1367.45  1368.00    279

In [17]:
ALBK = nseAA.loc[nseAA['id']=='ALBK']
ALBK.head()

           id      date      time   open  high    low  close volume
1003140  ALBK  20150703  09:16:00  88.00  88.3  87.65  88.20   7897
1003141  ALBK  20150703  09:17:00  88.20  88.2  88.00  88.10   6091
1003142  ALBK  20150703  09:18:00  88.05  88.3  88.05  88.20   3557
1003143  ALBK  20150703  09:19:00  88.20  88.4  88.20  88.25   8932
1003144  ALBK  20150703  09:20:00  88.25  88.3  88.10  88.25  13613

The follwing steps are followed for 'ABB' symbol
1. Converting 'date' col to YYYY-MM-DD as n 'NewDate'
2. Dropping 'date'
3. Splitting 'NewDate' into 'Day','Month','Year'
4. Dropping 'NewDate'
5. Splitting 'time' into 'hours','min',seconds'
6. Dropping 'time'

In [50]:
ABB.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 67711 entries, 224772 to 292482
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      67711 non-null  category
 1   open    67711 non-null  float64
 2   high    67711 non-null  float64
 3   low     67711 non-null  float64
 4   close   67711 non-null  float64
 5   volume  67711 non-null  object
 6   Day     67711 non-null  int64
 7   Month   67711 non-null  int64
 8   Year    67711 non-null  int64
 9   hour    67711 non-null  int32
 10  min     67711 non-null  int32
 11  sec     67711 non-null  int32
dtypes: category(1), float64(4), int32(3), int64(3), object(1)
memory usage: 8.0+ MB

In [26]:
ABB['NewDate'] =  pd.to_datetime(ABB['date'].astype(str),format='%Y%m%d')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [31]:
ABB= ABB.drop('date',axis=1)

In [37]:
ABB.head()

,id,time,open,high,low,close,volume,NewDate,Day,Month,Year
224772,ABB,09:16:00,1365.3,1370.95,1365.30,1369.55,82,2015-07-03,3,7,2015
224773,ABB,09:17:00,1371.0,1378.00,1370.80,1378.00,827,2015-07-03,3,7,2015
224774,ABB,09:18:00,1378.0,1378.00,1375.00,1376.00,425,2015-07-03,3,7,2015
224775,ABB,09:19:00,1377.9,1378.00,1375.00,1375.05,398,2015-07-03,3,7,2015
224776,ABB,09:20:00,1375.0,1377.70,1367.45,1368.00,279,2015-07-03,3,7,2015

In [34]:
ABB['Day'] = pd.to_datetime(ABB['NewDate']).dt.day

In [35]:
ABB['Month'] = pd.to_datetime(ABB['NewDate']).dt.month

In [36]:
ABB['Year'] = pd.to_datetime(ABB['NewDate']).dt.year

In [44]:
ABB = ABB.drop('NewDate',axis=1)

In [41]:
ABB[['hour','min','sec']] = ABB['time'].astype(str).str.split(':', expand=True).astype(int)

In [42]:
ABB.head()

,id,time,open,high,low,close,volume,NewDate,Day,Month,Year,hour,min,sec
224772,ABB,09:16:00,1365.3,1370.95,1365.30,1369.55,82,2015-07-03,3,7,2015,9,16,0
224773,ABB,09:17:00,1371.0,1378.00,1370.80,1378.00,827,2015-07-03,3,7,2015,9,17,0
224774,ABB,09:18:00,1378.0,1378.00,1375.00,1376.00,425,2015-07-03,3,7,2015,9,18,0
224775,ABB,09:19:00,1377.9,1378.00,1375.00,1375.05,398,2015-07-03,3,7,2015,9,19,0
224776,ABB,09:20:00,1375.0,1377.70,1367.45,1368.00,279,2015-07-03,3,7,2015,9,20,0

In [46]:
ABB =ABB.drop('time',axis=1)

In [47]:
ABB.head()

,id,open,high,low,close,volume,Day,Month,Year,hour,min,sec
224772,ABB,1365.3,1370.95,1365.30,1369.55,82,3,7,2015,9,16,0
224773,ABB,1371.0,1378.00,1370.80,1378.00,827,3,7,2015,9,17,0
224774,ABB,1378.0,1378.00,1375.00,1376.00,425,3,7,2015,9,18,0
224775,ABB,1377.9,1378.00,1375.00,1375.05,398,3,7,2015,9,19,0
224776,ABB,1375.0,1377.70,1367.45,1368.00,279,3,7,2015,9,20,0

In [52]:
ALBK.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 78267 entries, 1003140 to 1081406
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      78267 non-null  category
 1   open    78267 non-null  float64
 2   high    78267 non-null  float64
 3   low     78267 non-null  float64
 4   close   78267 non-null  float64
 5   volume  78267 non-null  object
 6   Day     78267 non-null  int64
 7   Month   78267 non-null  int64
 8   Year    78267 non-null  int64
 9   hour    78267 non-null  int32
 10  min     78267 non-null  int32
 11  sec     78267 non-null  int32
dtypes: category(1), float64(4), int32(3), int64(3), object(1)
memory usage: 6.3+ MB

Following above mentioned steps in one cell for 'ALBK' symbol

In [48]:
ALBK['NewDate'] =  pd.to_datetime(ALBK['date'].astype(str),format='%Y%m%d')
ALBK= ALBK.drop('date',axis=1)
ALBK['Day'] = pd.to_datetime(ALBK['NewDate']).dt.day
ALBK['Month'] = pd.to_datetime(ALBK['NewDate']).dt.month
ALBK['Year'] = pd.to_datetime(ALBK['NewDate']).dt.year
ALBK = ALBK.drop('NewDate',axis=1)
ALBK[['hour','min','sec']] = ALBK['time'].astype(str).str.split(':', expand=True).astype(int)
ALBK =ALBK.drop('time',axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [49]:
ALBK.head()

,id,open,high,low,close,volume,Day,Month,Year,hour,min,sec
1003140,ALBK,88.00,88.3,87.65,88.20,7897,3,7,2015,9,16,0
1003141,ALBK,88.20,88.2,88.00,88.10,6091,3,7,2015,9,17,0
1003142,ALBK,88.05,88.3,88.05,88.20,3557,3,7,2015,9,18,0
1003143,ALBK,88.20,88.4,88.20,88.25,8932,3,7,2015,9,19,0
1003144,ALBK,88.25,88.3,88.10,88.25,13613,3,7,2015,9,20,0